<?php
	
switch($xoops_theme){
case "neilambilight":  
//佈景設定值
$settpl="b";
//佈景圖片格式 
$a0="";   
$a1="";
$a2="W429,H149"; 
$a3="JS播放器圖檔格式：jpg";   
$a4="JS播放器圖檔大小：W1278,H304";
$a5="a";  //可以使用佈景後台管理系統
$a6="7";  //按鈕上限
$a7="";  //LOGO顯示樣式
$a8=".png";   //ICOM格式
$a9="W16,H16";   //ICOM圖檔LOGO大小	
$a10="neilambilight";
$a11="按鈕圖檔大小：W570px,H150px";	
break;	
}
	
	
	
	
switch ($settpl){   
case "b":   
//佈景圖片格式 	
//佈景設定
$s0='0';  //是否啟用NO-IE6設置
$s1='0';  //是否顯示FLASH上的搜尋區塊
$s2='0';  //是否解全站自動錨點功能
$s3='0';  //是否啟用FB及G+的API按鈕功能
$s4='0';  //選擇右區塊顯示方式
$s5='0';  //是否於前端顯示關鍵字配置
$s6='0';  //是否啟用隨機顯示關鍵字功能
$s7='0';  //使用自動或手動按鈕對應模組反向功能
$s8='0';   //是否啟用子按鈕對應模組自動展開功能
$s9='0';   //是否啟用子按鈕底圖70%透明效果
$s10='0';  //佈景上方主選單樣式選擇
$s11='1';  //是否啟用新聞模組的內容顯示於跑馬燈功能
$s12='0';  //跑馬燈樣式選擇*
$s13='1';  //選擇跑馬燈速度*
$s14='0';  //LOGO樣式選擇
$s15='1';  //上傳LOGO圖檔需開啟
$s16='1';  //說明*
$s17='1';  //上傳第二LOGO圖檔需開啟說明
$s18='1';  //第二LOGO說明*	
$s19='0';  	
$s20='0';  	
$s21='0';  	
$s22='0';  	
$s23='0';  		
$s24='1'; 
$s25='1'; 	
$s26='1'; 
$s27='1'; 
$s28='1'; 
$s29='1'; 
$s30='1'; 
$s31='1'; 
$s32='1'; 
$s33='1'; 
$s34='1'; 
$s35='1'; 
$s36='1'; 
break;
}    
?>